Revit 2027 API
BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentError Property
 The solution is failing to do segments which are zero length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ZeroLengthSegmentError { get; }
Public Shared ReadOnly Property ZeroLengthSegmentError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ZeroLengthSegmentError {
	FailureDefinitionId^ get ();
}
static member ZeroLengthSegmentError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace